Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དམིགས་པ་དང་། དབང་དང་། དེ་མ་ཐག་པ་དང་། རྒྱུའི་རྐྱེན་ཁོང་དུ་ཆུད་པར་འདོད་པ་དང་། དེ་བཞིན་ཉིད་ཀྱི་རྣམ་པ་དང་། མཚན་ཉིད་ཁོང་དུ་ཆུད་པར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to comprehend the referential condition, the predominant condition, the immediate condition, and the causal condition, and those who wish to comprehend the aspects and defining characteristics of the real nature, should train in the perfection of wisdom. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་དང་། མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་། འགྱུར་བ་མེད་པའི་དེ་བཞིན་ཉིད་དང་། ཡང་དག་པ་ཇི་ལྟ་བའི་དེ་བཞིན་ཉིད་ཁོང་དུ་ཆུད་པར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to comprehend the real nature of all phenomena, the unmistaken real nature, the one and only real nature, the unchanging real nature, and the genuine, definitive real nature should train in the perfection of wisdom. “

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་དབྱིངས་ཁོང་དུ་ཆུད་པར་འདོད་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་ཡང་དག་པའི་མཐའ་ཁོང་དུ་ཆུད་པར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to comprehend the realm of phenomena with respect to all phenomena and who wish to comprehend the very limit of reality with respect to all phenomena should train in the perfection of wisdom. {

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཤེས་པར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱ་མཚོ་ཆེན་པོ་དང་། ཆུ་ཀླུང་དང་། ཆུ་ཀླུང་ཆེན་པོ་དང་། ཆུ་བྲན་དང་།
en: Dt.27} “Moreover, Śāradvatīputra, bodhisattva great beings who wish to know all the worlds of the great trichiliocosm, numerous as the grains of sand of the river Gaṅgā, should train in the perfection of wisdom.

source: ལྟེང་ཀ་དང་། མཚོ་དང་། རྫིང་བུ་དང་། ལུ་མ་དག་གི་ཆུའི་ཕུང་པོ་དེ་དག་ཐམས་ཅད་སྐྲའི་རྩེ་མོ་བརྒྱར་གཤེགས་པས་གྱེན་དུ་བླང་བར་འདོད་པ་དང་། དེ་ལ་གནས་པའི་སྲོག་ཆགས་རྣམས་ལ་ཡང་གནོད་པར་མི་འགྱུར་བར་འདོད་པས།
en: Bodhisattva great beings who wish to lift, on the tip of a filament that is one hundredth of the width of a hair, all the masses of water contained in the great trichiliocosm, including the great oceans, rivers, great rivers, tributaries, springs, lakes, pools, and ponds, and wish too to cause no harm to the living creatures inhabiting them, should train in the perfection of wisdom. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་མེའི་ཕུང་པོ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་འདི་ལྟ་སྟེ་དཔེར་ན། བསྐལ་པའི་མེ་ལྟར་མེ་ལྕེ་གཅིག་ཏུ་འབར་བར་གྱུར་ནའང་། དེ་ལྟར་འབར་བ་དེ་ཁའི་དབུགས་གཅིག་གིས་ཞི་བར་བྱ་བར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish with a single breath to extinguish all the masses of burning fire that there are in the great trichiliocosm, when all of them have burst into a single blazing flame like the eon’s final conflagration, should train in the perfection of wisdom. “

source: རླུང་གི་དཀྱིལ་འཁོར་ཇི་སྙེད་ཅིག་ཡོད་པ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཡང་། འདི་ལྟ་སྟེ་དཔེར་ན། ཕུབ་མ་སྤར་གང་ལ་བྱ་བ་ལྟར་གཏོར་གཡད་དེ། རྣམ་པར་འཇིག་པར་བྱེད་པ་དེ་ལྟ་བུར་རྣམ་པར་འཐོར་བ་ཆེན་པོའི་རླུང་གི་དཀྱིལ་འཁོར་སོར་མོ་གཅིག་གི་རྩེ་མོས་ཡོངས་སུ་ཁེབས་པར་བྱ་བར་འདོད་པ་དང་།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish with a single fingertip to cover and suppress all the whirling hurricanes in the great trichiliocosm that scatter, disperse, and destroy this great trichiliocosm as if it were just a handful of chaff, should train in the perfection of wisdom. {

source: གཞིལ་བར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་ནམ་མཁའི་དབྱིངས་ཇི་ཙམ་པ་དེ་ཐམས་ཅད་སྐྱིལ་མོ་ཀྲུང་གཅིག་གིས་རྒྱས་པར་དགང་བར་འདོད་པས།
en: Dt.28} “Moreover, Śāradvatīputra, bodhisattva great beings who wish with a single cross-legged sitting to completely fill however much there is of the great trichiliocosm’s entire expanse of space should train in the perfection of wisdom. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན། རིའི་རྒྱལ་པོ་རི་རབ་དང་ཁོར་ཡུག་དང་ཁོར་ཡུག་ཆེན་པོ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་སྐྲ་ཉག་མ་གཅིག་གིས་སྦམས་ཏེ་གྱེན་དུ་བཏེག་ནས། འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་གྲངས་མེད་པར་འཕང་ངོ་སྙམ་ན་ཡང་།
en: Moreover, Śāradvatīputra, if bodhisattva great beings have the thought that with a single tuft of hair they will gather and sweep up Mount Sumeru with all its single world systems and greater single world systems in the great trichiliocosm and hurl them beyond countless, inestimable world systems, they too should train in the perfection of wisdom. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་ཤིང་དང་རྩྭ་དང་གེལ་བ་དང་རྩི་དང་ནགས་ཚལ་མང་པོ་དང་རྡོ་དང་བོང་བ་དང་གྱོ་མོ་དང་རི་དང་ས་ཆེན་པོའི་ལྷུན་དེ་དག་ཐམས་ཅད་རྡུལ་ཤིན་དུ་ཕྲ་བའི་ཚུལ་དུ་ཤེས་པར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to understand in terms of minute atomic particles all the trees, grasslands, twigs, sap, woodlands, stones, clay, bricks, mountains, and land masses of the great trichiliocosm should train in the perfection of wisdom. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དང་བཅས་པ། ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ཇི་སྙེད་ཅིག་བཞུགས་པ་དེ་དག་ཐམས་ཅད་བསོད་སྙོམས་གཅིག་གིས་ཁྱེད་པར་བྱ་བར་འདོད་པ་དང་། དེ་བཞིན་དུ་མེ་ཏོག་གཅིག་དང་། ཕྲེང་བ་གཅིག་དང་སྤོས་གཅིག་དང་བྱུག་པ་གཅིག་དང་ཕྱེ་མ་གཅིག་དང་། ན་བཟའ་གཅིག་དང་རྒྱན་གཅིག་དང་གདུགས་གཅིག་དང་རྒྱལ་མཚན་གཅིག་དང་བ་དན་གཅིག་གིས་རིམ་གྲོར་བྱ་བར་འདོད་པ་དང་། བཀུར་སྟིར་བྱ་བར་འདོད་པ་དང་། བསྟི་སྟང་དུ་བྱ་བར་འདོད་པ་དང་། མཆོད་པར་བྱ་བར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish with a single alms bowl to satisfy all the blessed lord buddhas who reside in the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, along with their assemblies of bodhisattvas and communities of śrāvakas, and likewise who wish with a single flower, a single garland, a single piece of incense, a single unguent, a single powder, a single robe, a single ornament, a single parasol, a single victory banner, or a single ribbon to serve, respect, honor, and worship them, should train in the perfection of wisdom.

source: །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་དང་། འོག་དང་སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དང་བཅས་པ། ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ཇི་སྙེད་ཅིག་བཞུགས་པ་དེ་དག་ཐམས་ཅད་བསོད་སྙོམས་གཅིག་གིས་ཁྱེད་པར་བྱ་བར་འདོད་པ་དང་། དེ་བཞིན་དུ་མེ་ཏོག་གཅིག་དང་ཕྲེང་བ་གཅིག་དང་། སྤོས་གཅིག་དང་། བྱུག་པ་གཅིག་དང་ཕྱེ་མ་གཅིག་དང་། ན་བཟའ་གཅིག་དང་། རྒྱན་གཅིག་དང་གདུགས་གཅིག་དང་། རྒྱལ་མཚན་གཅིག་དང་། བ་དན་གཅིག་གིས་རིམ་གྲོར་བྱ་བར་འདོད་པ་དང་། བཀུར་སྟིར་བྱ་བར་འདོད་པ་དང་། བསྟི་སྟང་དུ་བྱ་བར་འདོད་པ་དང་། མཆོད་པར་བྱ་བར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Likewise, bodhisattva great beings who wish with a single alms bowl to satisfy all the blessed lord buddhas who reside in the world systems of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, and in the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, along with their assemblies of bodhisattvas and communities of śrāvakas, and likewise who wish with a single flower, a single garland, a single piece of incense, a single unguent, a single powder, a single robe, a single ornament, a single parasol, a single victory banner, or a single ribbon to serve, respect, honor, and worship them, should train in the perfection of wisdom. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། སེམས་ཅན་ཇི་སྙེད་ཅིག་འཁོད་པ་དེ་དག་ཐམས་ཅད་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ལ་དགོད་པར་འདོད་པ་དང་། ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་དང་། ཤེས་རབ་ཀྱི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བའི་ཕུང་པོ་ལ་དགོད་པར་འདོད་པ་དང་། རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་ལ་དགོད་པར་འདོད་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་དང་། ཕུང་པོ་མ་ལུས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་ཀྱི་བར་ལ་དགོད་པར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Moreover, Śāradvatīputra, those bodhisattva great beings who wish to establish all beings, as many as are present in the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, in the aggregate of ethical discipline; who wish to establish them also in the aggregate of meditative stability, the aggregate of wisdom, the aggregate of liberation, and the aggregate of seeing the wisdom of liberation; who wish to establish them in the fruit of entering the stream to nirvāṇa; and who wish to establish them in the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, in arhatship, and individual enlightenment, up to and including the expanse of nirvāṇa where there is no residue of the psycho-physical aggregates, should all train in the perfection of wisdom.

source: །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་སེམས་དཔའ་ཆེན་པོ་ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་དང་། འོག་དང་སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། སེམས་ཅན་ཇི་སྙེད་ཅིག་འཁོད་པ་དེ་དག་ཐམས་ཅད་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ལ་དགོད་པར་འདོད་པ་དང་། ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་དང་། ཤེས་རབ་ཀྱི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བའི་ཕུང་པོ་ལ་དགོད་པར་འདོད་པ་དང་། རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་ལ་དགོད་པར་འདོད་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་ལ་དགོད་པར་འདོད་པ་དང་། ཕུང་པོ་མ་ལུས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་ཀྱི་བར་ལ་དགོད་པར་འདོད་པས།
en: Those bodhisattva great beings who wish likewise to establish all beings, as many as are present in the world systems of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, along with the directions of the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, in the aggregate of ethical discipline; who wish to establish them also in the aggregate of meditative stability, the aggregate of wisdom, the aggregate of liberation, and the aggregate of seeing the wisdom of liberation; who wish to establish them in the fruit of entering the stream to nirvāṇa; who wish to establish them in the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, in arhatship, and individual enlightenment; and who wish to establish them in the expanse of nirvāṇa where there is no residue of the psycho-physical aggregates should all train in the perfection of wisdom. {

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ན། སེམས་ཅན་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་དང་། ཐེག་པ་ཆེན་པོས་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བར་འདོད་པས།
en: Dt.29} “Moreover, Śāradvatīputra, bodhisattva great beings who wish to bring all beings, as many as there are in all the world systems of the ten directions, to final nirvāṇa by means of the vehicles of the śrāvakas and pratyekabuddhas, and by means of the Great Vehicle, should train in the perfection of wisdom. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། སྦྱིན་པ་གཏོང་བའི་ཚེ་འདི་ལྟར་བསླབ་པར་བྱ་སྟེ།
en: Moreover, Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom and engage in acts of generosity, they should train accordingly.

source: སྦྱིན་པ་རྣམ་པ་འདི་ལྟར་བྱིན་ན་ནི་འབྲས་བུ་ཆེན་པོར་འགྱུར།
en: When they give their gifts in that way, those great fruits will come to pass.

source: སྦྱིན་པ་འདི་ལྟར་བྱིན་ན་ནི་རྒྱལ་རིགས་ཆེ་ཞིང་མཐོ་བའི་རིགས་སུ་སྐྱེ།
en: When they give their gifts in that way, they will be born into great and lofty royal families.

source: སྦྱིན་པ་འདི་ལྟར་བྱིན་ན་ནི་བྲམ་ཟེ་ཆེ་ཞིང་མཐོ་བའི་རིགས་སུ་སྐྱེ།
en: When they give their gifts in that way, they will be born into great and lofty priestly families.

source: སྦྱིན་པ་འདི་ལྟར་བྱིན་ན་ནི། ཁྱིམ་བདག་ཆེ་ཞིང་མཐོ་བའི་རིགས་སུ་སྐྱེ། སྦྱིན་པ་འདི་ལྟར་བྱིན་ན་ནི།
en: When they give their gifts in that way, they will be born into great and lofty householder families.

source: སྦྱིན་པ་དེ་ཉིད་ལ་གནས་པས། རྒྱལ་པོ་ཆེན་པོ་བཞིའི་རིས་ཀྱི་ལྷའི་ནང་དུ་སྐྱེ།
en: When they give their gifts in that way, by maintaining that very generosity, they will be born among the gods of the Caturmahā­rāja­kāyika realm.

source: སྦྱིན་པ་འདི་ལྟར་བྱིན་ན་ནི། སྦྱིན་པ་དེ་ཉིད་ལ་གནས་པས། སུམ་ཅུ་རྩ་གསུམ་དང་། མཚེ་མ་དང་དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷའི་ནང་དུ་སྐྱེ།
en: When they give their gifts in that way, by maintaining that very generosity, they will be born among the gods of the Trayastriṃśa, Yāma, Tuṣita, Nirmāṇarata, and Para­nirmita­vaśa­vartin realms.

source: སྦྱིན་པ་འདི་ལྟར་བྱིན་ན་ནི་སྦྱིན་པ་དེ་ཉིད་ལ་གནས་པས། བསམ་གཏན་དང་པོ་འགྲུབ་པར་འགྱུར། བསམ་གཏན་གཉིས་པ་དང་། གསུམ་པ་དང་། བཞི་པ་འགྲུབ་པར་འགྱུར། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་མཉམ་པར་གཞག་པ་ལ་སྙོམས་པར་འཇུག་པར་འགྱུར། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་མཉམ་པར་གཞག་པ་དང་།
en: When they give their gifts in that way, by maintaining that very generosity, they will attain the first meditative concentration, they will attain the second, third, and fourth meditative concentrations, they will become absorbed in the meditative absorption of the sphere of infinite space, and they will become absorbed in the meditative absorption of the sphere of infinite consciousness, in the meditative absorption of the sphere of nothing-at-all, and in the meditative absorption of the sphere of neither perception nor nonperception.

source: ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ཀྱི་མཉམ་པར་གཞག་པ་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་མཉམ་པར་གཞག་པ་ལ་སྙོམས་པར་འཇུག་པར་འགྱུར། སྦྱིན་པ་འདི་ལྟར་བྱིན་ན་ནི། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་འབྱུང་བར་འགྱུར།
en: When they give their gifts in that way, the thirty-seven factors conducive to enlightenment will emerge.

source: སྦྱིན་པ་འདི་ལྟར་བྱིན་ན་ནི། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་འབྱུང་བར་འགྱུར།
en: When they give their gifts in that way, emptiness, signlessness, and wishlessness will emerge.

source: སྦྱིན་པ་འདི་ལྟར་བྱིན་ན་ནི་རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་པར་འགྱུར། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་།
en: When they give their gifts in that way, they will attain the fruit of entering the stream to nirvāṇa.

source: ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་པར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Those who wish to attain the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, individual enlightenment, and unsurpassed, complete enlightenment should train in the perfection of wisdom. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཐབས་མཁས་པས་སྦྱིན་པ་འདི་ལྟར་བྱིན་ན་ནི། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །དེ་བཞིན་དུ།
en: Moreover, Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom, if they give their gifts with skill in means in that way, they will perfect the perfection of generosity.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ་ཞེས་བྱ་བར་བསླབ་པར་བྱའོ།
en: They should train likewise in the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྦྱིན་པ་རྣམ་པ་ཇི་ལྟ་བུར་སྩལ་ན། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བགྱིས་པ་ལགས།
en: Then the venerable Śāradvatīputra asked the Blessed One, “Blessed Lord, how do bodhisattva great beings, when they give their gifts, perfect the perfection of generosity?

source: ཇི་ལྟར་ན་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བགྱིས་པ་ལགས།
en: How do they perfect the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་སྦྱིན་པ་དང་། གཏོང་བ་དང་། ཡོངས་སུ་ལེན་པ་མི་དམིགས་པའི་ཚུལ་གྱིས་འཁོར་གསུམ་ཡོངས་སུ་དག་པས། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱས་པ་ཡིན།
en: Śāradvatīputra,” replied the Blessed One, “the perfection of generosity is perfected through purity with respect to the three spheres—without apprehending a gift, a giver, or a recipient.

source: དེ་བཞིན་དུ་ལྟུང་བ་དང་མི་ལྟུང་བ་བྱ་བ་མེད་པའི་ཕྱིར། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱས་པ་ཡིན།
en: Similarly, the perfection of ethical discipline is perfected since there are no downfalls and no nondownfalls to be committed.

source: འཁྲུག་པ་མེད་པའི་ཕྱིར། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱས་པ་ཡིན།
en: The perfection of tolerance is perfected since there is no disturbance.

source: ལུས་དང་སེམས་ཀྱི་བརྩོན་འགྲུས་འཇིག་པ་མེད་པའི་ཕྱིར། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱས་པ་ཡིན།
en: The perfection of perseverance is perfected since there are no physical or mental endeavors to be neglected.

source: འཁྲུགས་པ་དང་རྟོག་པ་མེད་པའི་ཕྱིར། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱས་པ་ཡིན།
en: The perfection of meditative concentration is perfected since there is no disturbance or thought.

source: ཆོས་ཐམས་ཅད་རབ་ཏུ་ཤེས་པ་མི་དམིགས་པའི་ཚུལ་གྱིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱས་པ་ཡིན་ནོ།
en: The perfection of wisdom is perfected by knowing all phenomena without apprehending anything. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འདས་པ་དང་མ་བྱོན་པ་དང་ལྟར་བྱུང་བ་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་ཐམས་ཅད་ཤེས་པར་འདོད་པ་དང་ཐོབ་པར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to know and who wish to acquire all the attributes of the lord buddhas of the past, future, and present should train in the perfection of wisdom. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་འདུས་བྱས་དང་། འདུས་མ་བྱས་རྣམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་གང་ཟག་པ་དང་བཅས་པ་དང་། ཟག་པ་མེད་པ་དང་དགེ་བ་དང་མི་དགེ་བ་དང་འཇིག་རྟེན་པ་དང་འཇིག་རྟེན་ལས་འདས་པ་དང་གཟུགས་ཡོད་པ་དང་གཟུགས་མེད་པ་དང་ལུང་བསྟན་དུ་ཡོད་པ་དང་། ལུང་བསྟན་དུ་མེད་པ་དང་། ངེས་པ་དང་། མ་ངེས་པ་དང་། འབྱུང་བ་དང་། མི་འབྱུང་བ་དང་།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to go beyond conditioned and unconditioned dharmas should train in the perfection of wisdom.

source: འགྲིབ་པའི་ཚུལ་ཅན་དང་། ཁྱད་པར་གྱི་ཚུལ་ཅན་དང་། སོ་སོའི་སྐྱེ་བོའི་ཆོས་དང་འཕགས་པའི་ཆོས་དང་། སློབ་པའི་ཆོས་དང་། མི་སློབ་པའི་ཆོས་དང་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཆོས་དང་།
en: Bodhisattva great beings who wish to go beyond all dharmas—dharmas that are contaminated and uncontaminated, virtuous and nonvirtuous, specific and indeterminate, definitive and nondefinitive, occurring and nonoccurring, obscured and distinguished, as well as the dharmas of ordinary people, the dharmas of sublime beings, the dharmas that are learned, the dharmas that are not learned, the dharmas of the śrāvakas and pratyekabuddhas, and the dharmas of the bodhisattvas and the dharmas of the buddhas—should all train in the perfection of wisdom. “

source: བྱང་ཆུབ་སེམས་དཔའི་ཆོས་དང་སངས་རྒྱས་ཀྱི་ཆོས་དང་། ཆོས་ཐམས་ཅད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པར་འགྲོ་བར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་འདས་པ་དང་མ་འོངས་པ་དང་ད་ལྟར་བྱུང་བ་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཁོང་དུ་ཆུད་པར་འདོད་པས།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to comprehend the real nature of all dharmas arising in the past, in the future, and in the present should train in the perfection of wisdom. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱི་མི་སྐྱེ་བའི་མཐར་ཕྱིན་པར་འདོད་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་ཡང་དག་པའི་མཐའ་རྟོགས་པར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to conclusively determine that all dharmas are nonarising, and those who wish to realize the very limit of reality with respect to all dharmas, should train in the perfection of wisdom. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྔོན་དུ་འགྲོ་བར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to have precedence over all śrāvakas and pratyekabuddhas should train in the perfection of wisdom. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ལ་རིམ་གྲོར་བྱ་བར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to serve all the lord buddhas should train in the perfection of wisdom. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱི་ནང་གི་འཁོར་དུ་འགྱུར་བར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to be present within the intimate retinue of all the lord buddhas should train in the perfection of wisdom. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཁོར་མང་པོ་དང་ལྡན་པར་འདོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་ཐོབ་པར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to have many attendants and who wish to acquire a retinue of bodhisattvas should train in the perfection of wisdom. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་བདག་ཐམས་ཅད་ཀྱི་སྦྱིན་པ་ཡོངས་སུ་དག་པར་བྱ་བར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པ་ལ་ཐོགས་པ་མེད་པའི་སེམས་དང་ལྡན་པར་འདོད་པ་དང་།
en: Moreover, Śāradvatīputra, bodhisattva great beings who wish to purify the gifts of all donors should train in the perfection of wisdom. “
